12/data/attachments/d1b2eb15c2ddf87c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_db3e76ae-7435-480c-8a61-666475832b79</nif:username>
            <nif:friendToBeAdded>Lindsey_two_Friend_57997_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>